do

function run(msg, matches)
  return "🌀 راهنمای تفریحی روبات 🌀

➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖
⭕️ !abjad [name]
💢 مشاهده عدد ابجد اسم
➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖
⭕️ !active
💢 مشاهده لیست فعالان گروه
➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖
⭕️ !aparat [value]
💢 جستجوی متن در آپارات
➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖
⭕️ !arz 
💢 مشاهده قیمت ارز
➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖
⭕️ !praytime [city]
💢 مشاهده اوقات شرعی شهر ها
➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖
⭕️ !calc [furmolas]
💢 انجام محاسبات ریاضی
➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖
⭕️ !date
💢 مشاهده تاریخ روز
➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖
⭕️ !tr [en/fa]  [text]
💢 معنی کلمات
➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖
⭕️ !echo [text]
💢 تکرار کلمه
➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖
⭕️ !fal
💢 دریافت فال حافظ
➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖
⭕️ !write [text]
💢 طراحی متن با فونت های مختلف
➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖
⭕️ !gif [text]
💢 تبذیل متن به گیف
➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖
⭕️ !feedback [text]
💢 ارسال نظر به سازنده
➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖
⭕️ !cap [text]
💢 نوشتن متن زیر عکس با ریپلی
➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖
⭕️ !cap 
💢 مشاهده عکس زیر متن با ریپلی
➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖
⭕️ !insta [instagram link]
💢 دریافت مشخصات پروفایل اینستاگرام
➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖
⭕️ !keep calm [text] [text] [text]
💢 دریافت استیکر
➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖
⭕️ !photo
💢 دریافت عکس از استیکر ارسالی با ریپلی
➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖
⭕️ !reqgp
💢 ارسال درخواست گروه به سازنده
➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖
⭕️ !sticker
💢 دریافت استیکر از عکس ارسالی با ریپلی
➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖
⭕️ !tagall [text]
💢 تگ کردن اعضای گروه و نوشتن متن ارسالی در پایان آن
➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖
⭕️ !sticker [text] [color] [font]
💢 تبدیل متن به استیکر
➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖
⭕️ !time
💢 مشاهده زمان
➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖
⭕️ !voice [text]
💢 تبدیل متن به صدا
➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖
⭕️ !weather [city]
💢 دریافت آب و هوای شهر مورد نظر
➖➖➖➖➖➖➖➖➖➖➖➖➖➖➖"
end

return {
  description = "Fun Help", 
  usage = "/helpfun : robot help",
  patterns = {
    "^[!/#]([Hh]elpfun)$",
    "^([Hh]elpfun)$"
  }, 
  run = run 
}

end

